app/controllers/organisations_controller.rb

  def index
    @organisations = Organisation.all
---
SELECT "organisations".* FROM "organisations"

  def create
    @organisation = Organisation.new(organisation_params)

    if @organisation.save
---
INSERT INTO "organisations" ("name", "hourly_rate", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "org1"], ["hourly_rate", "15.0"], ["created_at", "2021-05-03 21:31:05.920851"], ["updated_at", "2021-05-03 21:31:05.920851"]]

  def update
    if @organisation.update(organisation_params)
---
UPDATE "organisations" SET "hourly_rate" = $1, "updated_at" = $2 WHERE "organisations"."id" = $3  [["hourly_rate", "10.0"], ["updated_at", "2021-05-05 00:32:26.792670"], ["id", 9]]

    def set_organisation
      @organisation = Organisation.find(params[:id])
---
SELECT "organisations".* FROM "organisations" WHERE "organisations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]