app/controllers/shifts_controller.rb

  def index
    @shifts = Shift.all
---
SELECT "shifts".* FROM "shifts"

  def create
    @shift = Shift.new(shift_params)

    if @shift.save
---
INSERT INTO "shifts" ("user_id", "start", "end", "break_length", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 8], ["start", "2021-05-05 03:37:01"], ["end", "2021-05-05 03:37:01"], ["break_length", 20], ["created_at", "2021-05-05 03:37:01.406844"], ["updated_at", "2021-05-05 03:37:01.406844"]]

  def destroy
    @shift.destroy
---
DELETE FROM "shifts" WHERE "shifts"."id" = $1  [["id", 1]]

    def set_shift
      @shift = Shift.find(params[:id])
---
SELECT "shifts".* FROM "shifts" WHERE "shifts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]