app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 9]]
---
  def show
    @user = User.where(id: @user.id)

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at", "organisation_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create

    @user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "clayton123"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(name: params[:name])

UPDATE "users" SET "updated_at" = $1, "organisation_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-05-05 05:55:24.324154"], ["organisation_id", 1], ["id", 1]]
---
  def update
    if @user.update(user_params)